---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalService.ExternalServiceId
source: html/4d1baf1a-6529-c131-530e-917a45649488.htm
---
# ExternalServiceId Properties

The Guid of GUID-based enum object.